//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
// $Archive:  $
//
// $Author:  $
//
// $Revision:  $
//
// $Date: $
//
//*****************************************************************//
//*****************************************************************//
// Revision History
// ----------------
// $Log:  $
// 
//
//*****************************************************************//

//**********************************************************************
//<AMI_FHDR_START>
//
// Name: Setup.uni
//
// Description: Setup strings.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
#string STR_FIXED_BOOT_ORDER_SUBTITLE   #language eng "FIXED BOOT ORDER Priorities"

#string STR_BOOT_OPTION          #language eng "Boot Option #%d"
#string STR_BOOT_OPTION_HELP     #language eng "Sets the system boot order"


#string STR_BOOT_HDD			#language eng "Hard Disk"
#string STR_BOOT_CDROM			#language eng "CD/DVD"
#string STR_BOOT_NETWORK		#language eng "Network"
#string STR_BOOT_USBHDD			#language eng "USB Hard Disk"
#string STR_BOOT_USBODD			#language eng "USB CD/DVD"
#string STR_BOOT_USBFDD			#language eng "USB Floppy"
#string STR_BOOT_USBKEY			#language eng "USB Key"

#string STR_BOOT_UEFI_HDD		#language eng "Hard Disk"
#string STR_BOOT_UEFI_CDROM		#language eng "CD/DVD"
#string STR_BOOT_UEFI_NETWORK	#language eng "Network"
#string STR_BOOT_UEFI_USBHDD	#language eng "USB Hard Disk"
#string STR_BOOT_UEFI_USBODD	#language eng "USB CD/DVD"
#string STR_BOOT_UEFI_USBFDD	#language eng "USB Floppy"
#string STR_BOOT_UEFI_USBKEY	#language eng "USB Key"

#string STR_DUAL_BOOT_UEFI_HDD		#language eng "UEFI Hard Disk"
#string STR_DUAL_BOOT_UEFI_CDROM	#language eng "UEFI CD/DVD"
#string STR_DUAL_BOOT_UEFI_NETWORK	#language eng "UEFI Network"
#string STR_DUAL_BOOT_UEFI_USBHDD	#language eng "UEFI USB Hard Disk"
#string STR_DUAL_BOOT_UEFI_USBODD	#language eng "UEFI USB CD/DVD"
#string STR_DUAL_BOOT_UEFI_USBFDD	#language eng "UEFI USB Floppy"
#string STR_DUAL_BOOT_UEFI_USBKEY	#language eng "UEFI USB Key"

#string STR_BOOT_MODE_SEL		#language eng "Boot mode select"
#string STR_BOOT_MODE_SEL_HELP  #language eng "Select boot mode LEGACY/UEFI"
#string STR_BOOT_MODE_LEGACY    #language eng "LEGACY"
#string STR_BOOT_MODE_UEFI		#language eng "UEFI"
#string STR_BOOT_MODE_DUAL		#language eng "DUAL"

#string STR_HDD_BOOT_ORDER_SUBTITLE		#language eng "Hard Disk Drive BBS Priorities"
#string STR_HDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available Hard Disk Drives."
#string STR_ODD_BOOT_ORDER_SUBTITLE		#language eng "CDROM/DVD Drive BBS Priorities"
#string STR_ODD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available CDROM/DVD Drives."
#string STR_NET_BOOT_ORDER_SUBTITLE		#language eng "NETWORK Drive BBS Priorities"
#string STR_NET_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available NETWORK Drives."
#string STR_USBHDD_BOOT_ORDER_SUBTITLE	#language eng "USB Hard Disk Drive BBS Priorities"
#string STR_USBHDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available USB Hard Disk Drives."
#string STR_USBKEY_BOOT_ORDER_SUBTITLE	#language eng "USB Key Drive BBS Priorities"
#string STR_USBKEY_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available USB Key Drives."
#string STR_USBODD_BOOT_ORDER_SUBTITLE	#language eng "CDROM/DVD Drive BBS Priorities"
#string STR_USBODD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available CDROM/DVD Drives."
#string STR_USBFDD_BOOT_ORDER_SUBTITLE	#language eng "USB Floppy Drive BBS Priorities"
#string STR_USBFDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available USB Floppy Drives."

#string STR_UEFI_HDD_BOOT_ORDER_SUBTITLE	#language eng "UEFI Hard Disk Drive BBS Priorities"
#string STR_UEFI_HDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI Hard Disk Drives."
#string STR_UEFI_ODD_BOOT_ORDER_SUBTITLE	#language eng "UEFI CDROM/DVD Drive BBS Priorities"
#string STR_UEFI_ODD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI CDROM/DVD Drives."
#string STR_UEFI_NET_BOOT_ORDER_SUBTITLE	#language eng "UEFI NETWORK Drive BBS Priorities"
#string STR_UEFI_NET_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI NETWORK Drives."
#string STR_UEFI_USBHDD_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB Hard Disk Drive BBS Priorities"
#string STR_UEFI_USBHDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI USB Hard Disk Drives."
#string STR_UEFI_USBODD_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB CDROM/DVD Drive BBS Priorities"
#string STR_UEFI_USBODD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI USB CDROM/DVD Drives."
#string STR_UEFI_USBKEY_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB Key Drive BBS Priorities"
#string STR_UEFI_USBKEY_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI USB Key Drives."
#string STR_UEFI_USBFDD_BOOT_ORDER_SUBTITLE	#language eng "UEFI USB Floppy Drive BBS Priorities"
#string STR_UEFI_USBFDD_BOOT_ORDER_HELP     	#language eng "Specifies the Boot Device Priority sequence from available UEFI USB Floppy Drives."

//Use for AMIBCP tool
#string STR_BCP_DEFAULT_SUBTITLE #language eng "BCP Legacy/Uefi mode defualt priority setting"
#string STR_BCP_UEFI_DEFAULT_SUBTITLE #language eng "BCP Uefi mode defualt priority setting"
#string STR_BCP_LEGACY_DEFAULT_SUBTITLE #language eng "BCP Legacy mode defualt priority setting"
#string STR_BCP_DUAL_DEFAULT_SUBTITLE #language eng "BCP Dual mode defualt priority setting"

#string STR_BOOT_ORDER_1 		#language eng "Boot Option #1"
#string STR_BOOT_ORDER_2 		#language eng "Boot Option #2"
#string STR_BOOT_ORDER_3 		#language eng "Boot Option #3"
#string STR_BOOT_ORDER_4 		#language eng "Boot Option #4"
#string STR_BOOT_ORDER_5 		#language eng "Boot Option #5"
#string STR_BOOT_ORDER_6 		#language eng "Boot Option #6"
#string STR_BOOT_ORDER_7 		#language eng "Boot Option #7"
#string STR_BOOT_ORDER_8 		#language eng "Boot Option #8"
#string STR_BOOT_ORDER_9 		#language eng "Boot Option #9"
#string STR_BOOT_ORDER_10 		#language eng "Boot Option #10"
#string STR_BOOT_ORDER_11 		#language eng "Boot Option #11"
#string STR_BOOT_ORDER_12 		#language eng "Boot Option #12"
#string STR_BOOT_ORDER_13 		#language eng "Boot Option #13"
#string STR_BOOT_ORDER_14 		#language eng "Boot Option #14"
#string STR_BOOT_ORDER_15		#language eng "Boot Option #15"
#string STR_BOOT_ORDER_16		#language eng "Boot Option #16"
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
